print ("start code") #вывод строки
books = [ #создаем список
    {"title": "Сто лет одиночества", "author": "Габриэль Гарсиа", "year": "1967"}, #словарь с первой книгой
    {"title": "Мастер и Маргарита", "author": "Михаил Булгаков", "year": "1929"}, #словарь со второй книгой
    {"title": "Гордость и предубеждение", "author": "Джейн Остен", "year": "1813"}, #словарь с третьей книгой
    {"title": "Преступление и наказание", "author": "Федор Достоевский", "year": "1866"}, #словарь с четвертой книгой
    {"title": "Улисс", "author": "Джеймс Джойс", "year": "1922"},] #словарь с пятой книгой
for i in range(len(books)): #создаем цикл вывода каждого словаря
    print(f"---------------------- Книга {i + 1} ----------------------") #выводим новер книги
    print(f"Название: {books[i]["title"]}, Автор: {books[i]["author"]}") #выводим название и автора книги
    print(f"------------------------- {books[i]["year"]} -------------------------") #выводим год написания книги
    print() #добавляем пустую строчку
print ("end code") #вывод строки